class Translation(object):
    START_TEXT = """හලෝ {} උබ කැරියෙක් ද හූත්තෝ😎,
මම මුතු ඇටේ එකෙක් වැල බාන්න ගියාම storage පිරෙන හින්දා ටෙලිග්‍රෑම් එකට දාලා ඕන වෙලාවට ගන්න හදා ගත්තු බොටෙක් යකො🙂🙉
උබට රට අදාල නැතුව ඕන පකක් දාගනින් මට කමක් නැ!

/help උබට තෙරුන්නැත්තන් ඔය පක ඔබල බලහන් ඤාන අක්කගෙන් උදව්වක් ගන්න ඇහැකි!"""

    FORMAT_SELECTION = "ඒ පක එව්වා නම් දැන් තොට ඕන මොන විදියටද කියලා තොරහන්: <a href='{}'>ෆයිල් සයිස් එක දරාගන්න පුළුවන් වෙන්න ඕන.</a> \nතොට ඉස්සරහට වැටෙන පින්තූරේ වෙනස් කරන්න ඕන නම් පල එකක් තෝරපු ගමන් ඒක එවන් පකො,\nඑවාපු පින්තූරේ හොඳ නැත්තං මේ හුත්තට ගහපන්/deletethumbnail👈"
    SET_CUSTOM_USERNAME_PASSWORD = """උබට සල්ලි දීලා ගත්ත මොකක් හරි ප්‍රොෆයිල් එකකට විතරක් අයිතිය දීපු හුත්තවල් බාගන්න පහළ විදියට ඒව ඒවන්:
URL | filename | username | password"""
    DOWNLOAD_START = "📥ඉදහන් මම දාගෙන තොට ඒවන්නම්😏..."
    UPLOAD_START = "📤මගේ වැඩේ හරි තවටිකයි ඉවසහන්😂..."
    RCHD_TG_API_LIMIT = " ඔන්න,/nවැල බාන්න ගියේ තත්පර {}\nවැලේ සයිස් එක: {}\nඒ උනාට මට උපරිම අප්ලෝඩ් කරන්න ටෙලිග්‍රෑම් එකෙන් ඉඩ දීලා තියෙන්නේ 2GB විතරයි හූත්තෝ🤧,"
    AFTER_SUCCESSFUL_UPLOAD_MSG = "ඔන්න <b>හරිනේ තොගේ පුකෙ අමාරුව</b> දැන් හොඳයි ද?🤣👋\n\n<b>ඔන්නම් මේ පකටත් join වෙයන්: @RXbots </b>"
    AFTER_SUCCESSFUL_UPLOAD_MSG_WITH_TS = "වැල බාන්න {} seconds.\nතොට එවන්න {} seconds.\n........."
    SAVED_CUSTOM_THUMB_NAIL = "පින්තූරේ හැමිනිල හූත්තෝ📝 බඩු ගොඩ✅."
    DEL_ETED_CUSTOM_THUMB_NAIL = "දාපු පින්තූරේ left✅"
    CUSTOM_CAPTION_UL_FILE = "{}"
    NO_VOID_FORMAT_FOUND = "වැඩේ හැමිනුණා...\n<b>YouTubeDL</b> said: {}"
    HELP_USER = """අම්ම ගන්න ගේරි බල්ලෝ පහළ පකවල් කියවලා බලහන්,!
    
1. Send url (example.domain/File.mp4 | New Filename.mp4).
2. Send Image As Custom Thumbnail (Optional).
3. Select the button.
   SVideo - Give File as video with Screenshots
   DFile  - Give File (video) as file with Screenshots
   Video  - Give File as video without Screenshots
   File   - Give File without Screenshots

මම වැඩ නැත්තං තෝ හුකා ගනින් පකො"""
    REPLY_TO_MEDIA_ALBUM_TO_GEN_THUMB = "පින්තූරයක් හදලා දාන්න ඔන්නම් ඇල්බම් එකට මේකත් දාලා replay කරහන් /generatecustomthumbnail "
    ERR_ONLY_TWO_MEDIA_IN_ALBUM = """ඇල්බම් එකේ තියෙන්න ඕන ෆොටෝ 2යි හුත්ටෝ. ආපහු එවහන්,මතක තියන් 2ක් විතරක් ඒවහන්
ෆයිල් එකට මේ පක දාලා reply කරහන් මම rename කරලා පින්තුරේත් වෙනස් කරන්නම් තෝ කියන විදියට,\n /rename 
"""
    CANCEL_STR = "නවත්තන්න මොකටද පකො එව්වේ🤬"
    ZIP_UPLOADED_STR = "කම්ප්‍රෙස් කරපු වැලක් නේ,\nබාන්න තත්පර {} වැල් දාන්න {}"
    SLOW_URL_DECED = "පොපෙක් වෙන්න එපා හූත්තෝ ඒක පට්ට ස්ලෝ ලින්ක් එකක් නේ බල්ලෝ🤬. ඒකෙන් මගේ සිස්ටම් එකත් අවුල් ගිය පකො,මට බෑ ඔය හුත්ත දාන්න😡. උබට ඕනෑම නම් පහළ ලින්ක් එකෙන් ගිහින් මට speed ලින්ක් එකක් ගෙනත් දාහන්🥴:==> https://shrtz.me/PtsVnf6 \n❌❌❌❌❌❌❌❌❌❌❌❌❌❌❌"
